var testData = [
    {
        name: '总览',
        infos: [
            '2016-F1',
            '2015-外滩'
        ]
    },
    {
        name: '中心区域',
        infos: [
            '2016-F1核心区域',
            '2015-外滩核心',
            '2015-外滩滨水区'
        ]
    },
    {
        name: '周边区域',
        infos: [
            '2016-F1周边区域',
            '2015-外滩周边'
        ]
    },
    {
        name: '其他',
        infos: [
            '2015-人民广场',
            '2015-人民广场地铁站',
            '2015-龙华寺',
            '2015-八佰伴',
            '2015-新天地'
        ]
    },
    {
        name: '自定义热点',
        infos: [
        ]
    }
];